# 正常场景-测试数据
success_data = {"user": "17701583363", "passwd": "583363"}

# 异常场景
phone_data = [{"user": "", "passwd": "583363", "check": "用户名不能为空"},
              {"user": "17701583333", "passwd": "583363", "check": "用户名/手机不存在"},
              {"user": "17701583363", "passwd": "111111", "check": "用户名/手机不存在或密码不正确"},
              {"user": "17701583363", "passwd": "", "check": "密码不能为空！"},
              {"user": "17701583363", "passwd": "583", "check": "密码长度不得小于6位数！"}]

#  "用户名不能为空"] 用户名空
#  "用户名/手机不存在"]  手机号错误
#  "用户名/手机不存在或密码不正确"]  密码错误
#  "密码不能为空！"]  密码为空
#  "密码长度不得小于6位数！"]  密码低于6位